acerbic
exacerbate
acid
acrid
acrimonious
acrimony
acuity
acumen
acute 
counteract
enact
reactionary
exactitude
exacting
aerate
aerial
aeronautics
anaerobic
agile
agitated
coagulate
exigent
prodigal
reagent
agog
demagogue
pedagogy
pedagogic
pedagogue
agony
antagonistic
protagonist
agrarian
peregrinate
coalesce
coalition
ail
analgesic
nostalgia
alienation
inalienable
exalt
alternative
altruism
amateur
amiable
amicable
amity
enmity
enamored
inimical
amble
ambulance
ambulatory
perambulate
preamble
ramble
scramble
shamble
amplify
ancestry
anguish
angular
rectangle
animadvert
animate
animated
animation 
animosity
animus
pusillanimous
unanimous
perennial
misanthrope
philanthropic
antecedent
antedate
antiquated
antique
adaptive
apt
aptitude
adept
deft
inept
aquarius
aqueous
arbitrary
arbitrage
arboreal
arboretum
anarchy
hierarchy
monarch
monarchy
patriarchal
ardent
arson
arsenal
armada
armistice
artifice
articulate
asperity
exasperate
asterisk
asteroid
astronomical
augment
august
authentic
authoritative
auxiliary
audacious
avid
banish
barrage
barricade
barrister
embargo
base
debase
baton
battalion
combative
lambaste
abate
benefactor
beneficent
benign
benevolent
ballistics
bellicose
belligerent
hyperbole
rebellious
embellish
imbibe
bibliomania
bibliography
forbid
forbidding
blemish
blithe
bombastic
boon
bounteous
abbreviate
brevity
debrief
blockbuster
bust
combustible
cadaver
cascade
casualty
coincide
decadence
occidental
nonchalant
scald
scalding
calculate
callous
callus
recalcitrant
candid
incendiary
incense
accentuate
cantankerous
chant
chantey
incentive
recant
capitulate
recapitulate
capacious
capsule
caption
captious
captivate
encapsulate
cardiac
cardinal
cardiogram
cardiologist
carnage
carnival
carnivaorous
carrion
incarcerate
incarnate
reincarnate
caustic
holocaust
cavity
excavate
cavalier
cavalry
chivalrous
concede
incessant
precede
precedent
unprecedented
predecessor
recede
secede
successively
celerity
censorious
censure
censor
centrifugal
eccentric
egocentric
deceive
inception
intercept
perceive
perceptive
receptive
susceptible
discern
chastise
castigate
chromatic
monochromatic
anachronistic
chronic
chronological
exorcise
incisive
incisor
perticide
supercilious
succinct
incinerate
emancipate
reciprocirty
incipient
precipitate
decipher
elicit
incite
insouciance
insouciant
resuscitate
solicit
slameor
clamorous
disclaim
disclaimer
exclaim
exclamation
proclaim
reclaim
clandestine
clannish
clairvoyance
disinclination
inclination
proclivity
recline
conclusive
occlude
preclude
reclusive
seclude
concoct
precocious
codify
decode
cognitive
cognizance
recognize
accolade
conciliatory
irreconcilable
reconcile
abscond
recondite
concord
cordial
discord
excoriate
copious
coronation
cosmopolitan
autocracy
aristocrat
theocracy
accrue
increment
accretion
miscreant
credence
credo
credulous
discredit
decrepit
discrepancy
discreet
discrete
discretion
discretionary
excrete
secrete
indiscriminate
hypocrite
pypocrisy
crusade
excruciate
crypt
cryptic
incubate
culprit
exculpate
cult
occult
horticultrue
inculcate
cumbersome
encumber
incumbent
succumb
covet
concur
cursory
curtail
discourse
discursive
excursive
incursion
precursor
procure
accuse
concussion
perscussion
repercussion
encyclopedic
cynical
cynosure
disdain
indignant
condemn
damn
indenmnify
decorous
decorum
deleterious
demotic
endemic
ambidexturous
dexterous
diurnal
nocturnal
quotidian
dilatory
dilemma
divergent
dubious
duplicity
abdicate
benefiction
dictate
indict
malediction
predicament
valediction
verdict
didactic
docile
doctrinaire
doctrine
condoel
condolence
doleful
dolorous
indolent
domain
dominate
predominant
condone
dormant
endorse
dogma 
dogmatism
heterodox
paradox
orthodox
orthodontics
adroit
maladroit
adduce
conducive
deduce
deduct
ductile
induce
seductive
overdue
subdue
endure
obdurate
exempt
peremptory
preempt
adequate
egalitarian
equable
equanimity
equate
equator
equilibrium
equitable
equivalent
equivocal
iniquitous
aberrant
errand
errant
erratic
erroneous
exert
inert
inertia
quintessential
aesthetic
ethos
longevity
dedieval
affable
blasphemy
defamatory
fable
fabulous
efficacious
facile
facility
facsimile
faction
factotum
factual
efface
facade
facetious
multifaceted
preface
self-effacement
effacement
fallacious
fallibility
falsification
default
pitfall
fanatical
fanciful
fanfare
malfeasance
affected
affection
affectionate
defect
counterfeit
forfeit
surfeit
felicific
felicitous
infelicitous
infelicity
confer
deference
peripheral
odoriferous
ferromagnetic
ferrous
ferment
fervent
confess
profess
artifice
beneficent
beneficiary
reckless
fictitious
maleficent
munificent
ramification
suffice
confidant
confide
diffident
fidelity
perfidious
perfidy
configuration
figurative
prefigure
affiliated
filial
filter
infiltrate
affinity
confine
definite
infinite
finesse
fine-tune
affirm
confiscate
fiscal
fixate
flamboyant
inflammatory
conflate
deflated
inflate
deflect
reflective
afflict
affliction
inflict
profligate
florid
affluent
fluid
influx
mellifluous
superfluous
defoliate
foliage
conformity
formative
formulaic
discomfit
fort
forte
fortify
fraction
fractious
fragmentary
frivolous
refract
refractory
suffrage
fraudulent
effrontery
upfront
fugitive
refugee
fulminate
fume
perfume
confound
founder
profound
perfunctory
defuse
diffuse
effusive
infuse
profuse
obfuscate
refute
refutable
garment
garnish
genealogy
genesis
genome
generic
genre
congenial
degenerate
engender
genial
heterogeneous
homogeneous
indigenous
ingenious
ingenuous
disingenuous
progeny
germane
germinate
ingest
hieroglyph
petroglyph
agnostic
ignorance
prognosis
granular
granule
ingrain
aggrandize
grandiloquence
grandiose
choreography
demography
graphite
holograph
gratify
ingrate
ingratiate
ingratiating
aggravate
gravity
egregious
gregarious
digressive
transgress
aggrieve
grievance
congruent
incongruous
habitable
inhabit
exhale
inhale
haphazard
mishap
harbinger
herald
hereditry
herbivorous
adhere
adherent
adhesive
coherent
heretical
exhilarate
hilarious
abhorrent
hortative
hortatory
humanitarian
inhumane
humble
humdrum
humility
posthumous
hydrate
iconoclastic
ideology
idiosyncratic
idolatrize
emulate
imitative
imitable
imperative
imperious
insulr
insulin
peninsula
disintegrate
integrity
circuitous
itinerant
transitional
transitory
abject
conjecture
dejected
objection
objective
adjourn
journal
judicious
prejudice
conjugal
subjugate
adjunct
conjunction
disjunctive
junction
juncture
abjure
conjure
jurisdiction
objurgate
justify
jubilation
juvenile
rejuvenate
belabor
elaboration
laborious
superlative
dilatory
bilateral
unilateral
deluge
dilute
lava
eclectic
electorate
predilection
allegiance
legitimate
legislature
relegate
alleviate
elated
elevate
leaven
levity
prolix
liberal
proliferate
prolific
obligatory
align
delineate
underline
delinquency
relinquish
eclipse
illiterate
literal
literate
obliterate
monolithic
neolithic
paleolithic
locus
apologist
circumlocution
colloquial
eloquence
eulogize
eulogy
loquacious
laconic
monolog
prophylactic
soliloquy
long-winded
prolong
elucidate
lucid
lucubration
pellucid
lucrative
allusive
collude
delude
elude
elusive
disillusioned
illusory
ludicrous
lurid
illuminate
luminary
preliminary
lunar
lunatic
lust
wanderlust
illustrative
illustrious
lackluster
luxuriant
malady
malevolent
malign
magnanimous
magnitude
impermanent
emanate
maneuver
manipulate
manuscript
demanding
mandate
mandatory
reprimand
mania
monomania
mar
martial
marine
mariner
demarcate
hallmark
marked
remarkable
remedy
mediate
mediocre
intermediary
meditate
meditation
premeditate
ameliorate
commemorate
memoir
memorandum
amenable
demean
demeanor
menace
minatory
amend
commend
emend
mendacious
mendacity
commensurate
immense
measured
demented
mentor
mercenary
symmetry
barometer
diameter
perimeter
emigrate
immigrate
migratory
eminent
imminent
preeminent
prominent
reminisce
reminiscent
diminish
miniature
minion
diminutive
minute
minuscule
mire
miraculous
mirage
demise
dismiss
intermittent
remiss
remission
submission
surmise
unremitting
vomit
mitigant
mitigate
amnesia
amnesty
mnemonics
moderate
modulate
outmoded
emollient
mollify
admonish
demonstrative
demonstrable
monstrous
remonstrance
demoralize
moralistic
morph
amorphous
metamorphose
mordant
remorse
amortize
morbid
moribund
mortify
demote
locomotive
promote
remote
paramount
surmount
tantamount
communal
immune
municipality
munificent
demur
murky
immutable
mutable
mute
mutilate
transmute
demystify
innate
nascent
natal
neonate
aeronautics
nausea
abnegate
negate
negligent
negligible
enervate
nerve
neutral
annex
denigrate
enigma
innocuous
noxious
noisome
obnoxious
pernicious
anomalous
anomaly
normative
ignominious
misnomer
nominal
nostalgia
