acerbic
exacerbate
acid
acrid
acrimonious
acrimony
acuity
acumen
acute 
counteract
enact
reactionary
exactitude
exacting
aerate
aerial
aeronautics
anaerobic
agile
agitated
coagulate
exigent
prodigal
reagent
agog
demagogue
pedagogy
pedagogic
pedagogue
agony
antagonistic
protagonist
agrarian
peregrinate
coalesce
coalition
ail
analgesic
nostalgia
alienation
inalienable
exalt
alternative
altruism
amateur
amiable
amicable
amity
enmity
enamored
inimical
amble
ambulance
ambulatory
perambulate
preamble
ramble
scramble
shamble
amplify
ancestry
anguish
angular
rectangle
animadvert
animate
animated
animation animosity
animus
pusillanimous
unanimous
perennial
misanthrope
philanthropic
antecedent
antedate
antiquated
antique
adaptive
apt
aptitude
adept
deft
inept
aquarius
aqueous
arbitrary
arbitrage
arboreal
arboretum
anarchy
hierarchy
monarch
monarchy
patriarchal
ardent
arson
arsenal
armada
armistice
artifice
articulate
asperity
exasperate
asterisk
asteroid
astronomical
augment
august
authentic
authoritative
auxiliary
audacious
avid
banish
barrage
barricade
barrister
embargo
base
debase
baton
battalion
combative
lambaste
abate
benefactor
beneficent
benign
benevolent
ballistics
bellicose
belligerent
hyperbole
rebellious
embellish
imbibe
bibliomania
bibliography
forbid
forbidding
blemish
blithe
bombastic
boon
bounteous
abbreviate
brevity
debrief
blockbuster
bust
combustible
cadaver
cascade
casualty
coincide
decadence
occidental
nonchalant
scald
scalding
calculate
callous
callus
recalcitrant
candid
incendiary
incense
accentuate
cantankerous
chant
chantey
incentive
recant
capitulate
recapitulate
capacious
capsule
caption
captious
captivate
encapsulate
cardiac
cardinal
cardiogram
cardiologist
carnage
carnival
carnivaorous
carrion
incarcerate
incarnate
reincarnate
caustic
holocaust
cavity
excavate
cavalier
cavalry
chivalrous
concede
incessant
precede
precedent
unprecedented
predecessor
recede
secede
successively
celerity
censorious
censure
censor
centrifugal
eccentric
egocentric
deceive
inception
intercept
perceive
perceptive
receptive
susceptible
discern
chastise
castigate
chromatic
monochromatic
anachronistic
chronic
chronological
exorcise
incisive
incisor
perticide
supercilious
succinct
incinerate
emancipate
reciprocirty
incipient
precipitate
decipher
elicit
incite
insouciance
insouciant
resuscitate
solicit
slameor
clamorous
disclaim
disclaimer
exclaim
exclamation
proclaim
reclaim
clandestine
clannish
clairvoyance
disinclination
inclination
proclivity
recline
conclusive
occlude
preclude
reclusive
seclude
concoct
precocious
codify
decode
cognitive
cognizance
recognize
accolade
conciliatory
irreconcilable
reconcile
abscond
recondite
concord
cordial
discord
excoriate
copious
coronation
cosmopolitan
autocracy
aristocrat
theocracy
accrue
increment
accretion
miscreant
credence
credo
credulous
discredit
decrepit
discrepancy
discreet
discrete
discretion
discretionary
excrete
secrete
indiscriminate
hypocrite
pypocrisy
crusade
excruciate
crypt
cryptic
incubate
culprit
exculpate
cult
occult
horticultrue
inculcate
cumbersome
encumber
incumbent
succumb
covet
concur
cursory
curtail
discourse
discursive
excursive
incursion
precursor
procure
accuse
concussion
perscussion
repercussion
encyclopedic
cynical
cynosure
disdain
indignant
condemn
danm
indenmnify
decorous
decorum
deleterious
demotic
endemic
ambidexturous
dexterous
diurnal
nocturnal
quotidiandilatory
dilemma
divergent
dubious
duplicity
abdicate
benefiction
dictate
indict
malediction
predicament
valediction
verdict
didactic
docile
doctrinaire
doctrine
condoel
condolence
doleful
dolorous
indolent
domain
dominate
predominant
condone
dormant
endorsedogma dogmatism
heterodox
paradox
orthodox
orthodontics
adroit
maladroit
adduce
conducive
deduce
deduct
ductile
induce
seductive
overdue
subdue
endure
obdurate
exempt
peremptory
preempt
adequate
egalitarian
equable
equanimity
equate
equator
equilibrium
equitable
equivalent
equivocal
iniquitous
aberrant
errand
errant
erratic
erroneous
exert
inert
inertia
quintessential
aesthetic
ethos
longevity
dedieval
affable
blasphemy
defamatory
fable
fabulous
efficacious
facile
facility
facsimile
faction
factotum
factual
efface
facade
facetious
multifaceted
preface
self-effacement
effacement
fallacious
fallibility
falsification
default
pitfall
fanatical
fanciful
fanfare
malfeasance
affected
affection
affectionate
defect
counterfeit
forfeit
surfeit
felicific
felicitous
infelicitous
infelicity
confer
deference
peripheral
odoriferous
ferromagnetic
ferrous
ferment
fervent
confess
profess
artifice
beneficent
beneficiary
reckless
fictitious
maleficent
munificent
ramification
suffice
confidant
confide
diffident
fidelity
perfidious
perfidy
configuration
figurative
prefigure
affiliated
filial
filter
infiltrate
affinity
confine
definite
infinite
finesse
fine-tune
affirm
confiscate
fiscal
fixate
flamboyant
inflammatory
conflate
deflated
inflate
deflect
reflective
afflict
affliction
inflict
profligate
florid
affluent
fluid
influx
mellifluous
superfluous
defoliate
foliage
conformity
formative
formulaic
discomfit
fort
forte
fortify
fraction
fractious
fragmentary
frivolous
refract
refractory
suffrage
fraudulent
effrontery
upfront
fugitive
refugee
fulminate
