acerbic
exacerbate
acid
acrid
acrimonious
acrimony
acuity
acumen
acute 
counteract
enact
reactionary
exactitude
exacting
aerate
aerial
aeronautics
anaerobic
agile
agitated
coagulate
exigent
prodigal
reagent
agog
demagogue
pedagogy
pedagogic
pedagogue
agony
antagonistic
protagonist
agrarian
peregrinate
coalesce
coalition
ail
analgesic
nostalgia
alienation
inalienable
exalt
alternative
altruism
amateur
amiable
amicable
amity
enmity
enamored
inimical
amble
ambulance
ambulatory
perambulate
preamble
ramble
scramble
shamble
amplify
ancestry
anguish
angular
rectangle
animadvert
animate
animated
animation 
animosity
animus
pusillanimous
unanimous
perennial
misanthrope
philanthropic
antecedent
antedate
antiquated
antique
adaptive
apt
aptitude
adept
deft
inept
aquarius
aqueous
arbitrary
arbitrage
arboreal
arboretum
anarchy
hierarchy
monarch
monarchy
patriarchal
ardent
arson
arsenal
armada
armistice
artifice
articulate
asperity
exasperate
asterisk
asteroid
astronomical
augment
august
authentic
authoritative
auxiliary
audacious
avid
banish
barrage
barricade
barrister
embargo
base
debase
baton
battalion
combative
lambaste
abate
benefactor
beneficent
benign
benevolent
ballistics
bellicose
belligerent
hyperbole
rebellious
embellish
imbibe
bibliomania
bibliography
forbid
forbidding
blemish
blithe
bombastic
boon
bounteous
abbreviate
brevity
debrief
blockbuster
bust
combustible
cadaver
cascade
casualty
coincide
decadence
occidental
nonchalant
scald
scalding
calculate
callous
callus
recalcitrant
candid
incendiary
incense
accentuate
cantankerous
chant
chantey
incentive
recant
capitulate
recapitulate
capacious
capsule
caption
captious
captivate
encapsulate
cardiac
cardinal
cardiogram
cardiologist
carnage
carnival
carnivaorous
carrion
incarcerate
incarnate
reincarnate
caustic
holocaust
cavity
excavate
cavalier
cavalry
chivalrous
concede
incessant
precede
precedent
unprecedented
predecessor
recede
secede
successively
celerity
censorious
censure
censor
centrifugal
eccentric
egocentric
deceive
inception
intercept
perceive
perceptive
receptive
susceptible
discern
chastise
castigate
chromatic
monochromatic
anachronistic
chronic
chronological
exorcise
incisive
incisor
perticide
supercilious
succinct
incinerate
emancipate
reciprocirty
incipient
precipitate
decipher
elicit
incite
insouciance
insouciant
resuscitate
solicit
slameor
clamorous
disclaim
disclaimer
exclaim
exclamation
proclaim
reclaim
clandestine
clannish
clairvoyance
disinclination
inclination
proclivity
recline
conclusive
occlude
preclude
reclusive
seclude
concoct
precocious
codify
decode
cognitive
cognizance
recognize
accolade
conciliatory
irreconcilable
reconcile
abscond
recondite
concord
cordial
discord
excoriate
copious
coronation
cosmopolitan
autocracy
aristocrat
theocracy
accrue
increment
accretion
miscreant
credence
credo
credulous
discredit
decrepit
discrepancy
discreet
discrete
discretion
discretionary
excrete
secrete
indiscriminate
hypocrite
pypocrisy
crusade
excruciate
crypt
cryptic
incubate
culprit
exculpate
cult
occult
horticultrue
inculcate
cumbersome
encumber
incumbent
succumb
covet
concur
cursory
curtail
discourse
discursive
excursive
incursion
precursor
procure
accuse
concussion
perscussion
repercussion
encyclopedic
cynical
cynosure
disdain
indignant
condemn
damn
indenmnify
decorous
decorum
deleterious
demotic
endemic
ambidexturous
dexterous
diurnal
nocturnal
quotidian
dilatory
dilemma
divergent
dubious
duplicity
abdicate
benefiction
dictate
indict
malediction
predicament
valediction
verdict
didactic
docile
doctrinaire
doctrine
condoel
condolence
doleful
dolorous
indolent
domain
dominate
predominant
condone
dormant
endorse
dogma 
dogmatism
heterodox
paradox
orthodox
orthodontics
adroit
maladroit
adduce
conducive
deduce
deduct
ductile
induce
seductive
overdue
subdue
endure
obdurate
exempt
peremptory
preempt
adequate
egalitarian
equable
equanimity
equate
equator
equilibrium
equitable
equivalent
equivocal
iniquitous
aberrant
errand
errant
erratic
erroneous
exert
inert
inertia
quintessential
aesthetic
ethos
longevity
dedieval
affable
blasphemy
defamatory
fable
fabulous
efficacious
facile
facility
facsimile
faction
factotum
factual
efface
facade
facetious
multifaceted
preface
self-effacement
effacement
fallacious
fallibility
falsification
default
pitfall
fanatical
fanciful
fanfare
malfeasance
affected
affection
affectionate
defect
counterfeit
forfeit
surfeit
felicific
felicitous
infelicitous
infelicity
confer
deference
peripheral
odoriferous
ferromagnetic
ferrous
ferment
fervent
confess
profess
artifice
beneficent
beneficiary
reckless
fictitious
maleficent
munificent
ramification
suffice
confidant
confide
diffident
fidelity
perfidious
perfidy
configuration
figurative
prefigure
affiliated
filial
filter
infiltrate
affinity
confine
definite
infinite
finesse
fine-tune
affirm
confiscate
fiscal
fixate
flamboyant
inflammatory
conflate
deflated
inflate
deflect
reflective
afflict
affliction
inflict
profligate
florid
affluent
fluid
influx
mellifluous
superfluous
defoliate
foliage
conformity
formative
formulaic
discomfit
fort
forte
fortify
fraction
fractious
fragmentary
frivolous
refract
refractory
suffrage
fraudulent
effrontery
upfront
fugitive
refugee
fulminate
fume
perfume
confound
founder
profound
perfunctory
defuse
diffuse
effusive
infuse
profuse
obfuscate
refute
refutable
garment
garnish
genealogy
genesis
genome
generic
genre
congenial
degenerate
engender
genial
heterogeneous
homogeneous
indigenous
ingenious
ingenuous
disingenuous
progeny
germane
germinate
ingest
hieroglyph
petroglyph
agnostic
ignorance
prognosis
granular
granule
ingrain
aggrandize
grandiloquence
grandiose
choreography
demography
graphite
holograph
gratify
ingrate
ingratiate
ingratiating
aggravate
gravity
egregious
gregarious
digressive
transgress
aggrieve
grievance
congruent
incongruous
habitable
inhabit
exhale
inhale
haphazard
mishap
harbinger
herald
hereditry
herbivorous
adhere
adherent
adhesive
coherent
heretical
exhilarate
hilarious
abhorrent
hortative
hortatory
humanitarian
inhumane
humble
humdrum
humility
posthumous
hydrate
iconoclastic
ideology
idiosyncratic
idolatrize
emulate
imitative
imitable
imperative
imperious
insulr
insulin
peninsula
disintegrate
integrity
circuitous
itinerant
transitional
transitory
abject
conjecture
dejected
objection
objective
adjourn
journal
judicious
prejudice
conjugal
subjugate
adjunct
conjunction
disjunctive
junction
juncture
abjure
conjure
jurisdiction
objurgate
justify
jubilation
juvenile
rejuvenate
belabor
elaboration
laborious
superlative
dilatory
bilateral
unilateral
deluge
dilute
lava
eclectic
electorate
predilection
allegiance
legitimate
legislature
relegate
alleviate
elated
elevate
leaven
levity
prolix
liberal
proliferate
prolific
obligatory
align
delineate
underline
delinquency
relinquish
eclipse
illiterate
literal
literate
obliterate
monolithic
neolithic
paleolithic
locus
apologist
circumlocution
colloquial
eloquence
eulogize
eulogy
loquacious
laconic
monolog
prophylactic
soliloquy
long-winded
prolong
elucidate
lucid
lucubration
pellucid
lucrative
allusive
collude
delude
elude
elusive
disillusioned
illusory
ludicrous
lurid
illuminate
luminary
preliminary
lunar
lunatic
lust
wanderlust
illustrative
illustrious
lackluster
luxuriant
malady
malevolent
malign
magnanimous
magnitude
impermanent
emanate
maneuver
manipulate
manuscript
demanding
mandate
mandatory
reprimand
mania
monomania
mar
martial
marine
mariner
demarcate
hallmark
marked
remarkable
remedy
mediate
mediocre
intermediary
meditate
meditation
premeditate
ameliorate
commemorate
memoir
memorandum
amenable
demean
demeanor
menace
minatory
amend
commend
emend
mendacious
mendacity
commensurate
immense
measured
demented
mentor
mercenary
symmetry
barometer
diameter
perimeter
emigrate
immigrate
migratory
eminent
imminent
preeminent
prominent
reminisce
reminiscent
diminish
miniature
minion
diminutive
minute
minuscule
mire
miraculous
mirage
demise
dismiss
intermittent
remiss
remission
submission
surmise
unremitting
vomit
mitigant
mitigate
amnesia
amnesty
mnemonics
moderate
modulate
outmoded
emollient
mollify
admonish
demonstrative
demonstrable
monstrous
remonstrance
demoralize
moralistic
morph
amorphous
metamorphose
mordant
remorse
amortize
morbid
moribund
mortify
demote
locomotive
promote
remote
paramount
surmount
tantamount
communal
immune
municipality
munificent
demur
murky
immutable
mutable
mute
mutilate
transmute
demystify
innate
nascent
natal
neonate
aeronautics
nausea
abnegate
negate
negligent
negligible
enervate
nerve
neutral
annex
denigrate
enigma
innocuous
noxious
noisome
obnoxious
pernicious
anomalous
anomaly
normative
ignominious
misnomer
nominal
nostalgia
nostrum
annotate
connotation
notch
notoriety
pronounced
denounce
nova
novelty
novice
anneal
annihilate
nullify
malodorous
odoriferous
abominate
omen
ominous
exonerate
onerous
acronym
anonymous
pseudonym
synonymous
opalescent
opaque
myopia
optical
optimistic
optimal
synopsis
opulent
adore
inexorable
oracle
oracular
oration
exorbitant
foreordain
ordinance
inordinate
insubordinate
subordinate
ornamental
ornate
ossify
appal
paltry
palpable
apparel
imperative
imperious
apparition
transparent
disparage
disparate
nonpareil
paritry
parody
compartment
counterpart
impart
impartial
partial
particulate
partisan
partition
impasse
surpass
trespass
antipathy
apathetic
compatible
compassionate
dispassionate
empathy
impassioned
impassive
passivity
pathogen
pathological
pathos
compatriot
expatriate
patriot
patronage
patronizing
impeccable
pecccadillo
impecunious
pecuniary
expedient
expedite
impede
pedestrian
pejorative
peripatetic
pedagogic
pedagogue
pedant
pedantic
compelling
dispel
impel
propel
repel
repellent
penalty
penitential
compendium
impending
penchate
pending
pensive
dispense
dispensable
personification
impersonate
appetite
impetuous
impetus
perpetuate
petition
petulant
propitious
petrify
petroleum
ephemeral
euphemism
sycophant
claustrophobic
phobia
xenophobe
cacophony
phony
symphony
aphorism
euphoria
metaphor
photosesitive
photosynthesis
neophythe
piety
pious
depict
picturesque
pine
pinnacle
pinpoint
complacent
complaisant
implacable
placate
placebo
placid
platitiude
supplant
implausible
laudatory
plausible
plenitude
replenish
complementary
deplete
plethora
replete
compliance
compliant
pliable
pliant
pliers
accomplice
duplicate
duplicitous
duplicity
explicable
explicit
implicate
implicit
inecplicable
replica
replicate
supplicate
deplorable
implore
extrapolate
cosmopolitan
impolitic
politic
pompous
ponder
ponderous
preponderate
opportune
opportunistic
purport
apposite
composed
decompose
disposable
disposition
impose
imposing
impostor
juxtapose
posit
predisposition
repository
despotic
omnipotent
potent
deprave
deprecate
precarious
apprehend
comprehensive
misapprehend
pressing
repress
suppress
unimpressed
primal
primacy
primitive
priority
pristine
deprive
privilege
privy
approbation
probity
reproof
reprove
propagate
propaganda
apropos
appropriate
malapropism
proprietary
propriety
prosaic
prose
approximate
proximity
imprudent
impudent
repudiate
impugn
pugnacious
repugnant
compulsory
convulsion
impulse
impulsive
repulse
compunction
punctilious
puncture
expurgate
purge
purify
empyrean
pyromania
quirky
acquiesce
acquiescence
quiesecent
tranquil
abrasive
eradicate
irascible
rapacious
erect
rectitude
resurrect
regime
regimental
rein
sovereign
sovereignty
surreptitious
deride
ridicule
ridiculous
rigid
rigor
rigorous
derivative
rife
riveting
corroborate
robust
corrode
erode
arrogant
derogate
derogatory
interrogate
prerogative
surrogate
rote
rotund
erudite
rudimentary
shrug
disrupt
sacrosanct
salubrious
salutary
assail
desultory
salient
sanatorium
sanitary
sanitize
insane
sane
sanctimonious
sanction
sanctuary
sanguine
insatiable
sate
satiate
sagacious
escalate
ascendancy
condescending
slander
transcend
transcendent
conscientious
omniscient
prescient
unconscionable
rescind
schism
circumscribe
inscription
prescription
proscribe
subscribe
transcribe
inscrutable
scrutinize
bisect
sectarianism
inconsequential
obsequious
persecute
sequacious
sedative
sedulous
supersed
assemble
dissemble
resemble
disseminate
seminal
assent
consensus
dissent
resent
sentiment
antiseptic
aseptic
septic
assert
conservative
observant
servile
subservient
undeserved
assiduous
dissident
insidious
subside
assimilate
dissimulate
simultaneous
verisimilitude
insinuate
sinuous
dissipate
insipid
consistent
insolent
obsolescent
obsolete
desolate
disconsolate
solitary
solitude
solo
consolidate
absolve
somnolent
soporific
consonant
dissonant
resonant
sonorous
philosophic
sophistication
sophistry
auspicious
circumspect
conspicuous
despicable
introspective
perspicuous
prospect
respect
respite
retrospective
specious
speculate
speculative
suspect
suspicion
desperate
aspersion
disperse
sparsse
awe-inspiring
conspiracy
inspired
perspire
respiration
resplendent
apostasy
armistice
circumstantial
constant
ecstatic
extant
forestall
bostinate
stalwart
stanch
standstill
static
staunch
stilted
understand
constellation
consternation
stigma
stigmatize
stint
instigate
constrain
restrain
hamstring
outstrip
strip
apostrophe
catastrophe
construe
misconstrue
instructive
consummate
presume
presumptuous
assure
reassure
insurgent
resurge
detached
dispatch
tact
tactless
contagious
contiguous
contingent
intangible
tangential
abstain
abstemious
abstinent
countenance
maintain
pertain
pertinent
sustain
sustenance
tenable
tenacious
tendentious
untenable
detect
detection
intemperance
temperate
contemplate
extemporize
temporal
contentious
distend
portend
portentous
tonic
attenduate
extenuate
tenuous
exterminate
interminable
deterrent
terrace
terrain
terrestrial
territorial
atheist
ethereal
pantheon
antithetical
synthesize
photosynthesis
intimidate
timorous
anatomical
dichotomy
epitome
attune
detonate
monotonous
distortion
extort
retort
torment
torque
torrent
tortuous
detour
intoxicate
intransigent
transient
transience
detract
intractable
protract
retract
subtract
tractable
entreat
treatise
tremulous
intrepid
trepidation
attribute
retribution
tribute
intricate
intrigue
treacherous
trenchant
contrite
diatribe
abstruse
intrude
obtrude
obtrusive
contumacious
tumultuous
imperturbable
turbid
turbulent
turmoil
archetypal
typify
ulterior
ultimate
ultimatum
adumbrate
umbrage
abundant
conundrum
redundant
abuse
disabuse
utilitarian
vacuous
evade
evasive
pervade
pervasive
extravagant
ambivalent
prevalent
valiant
valorize
valediction
evanescent
vainglorious
vapid
prevaricate
variabliliry
adventurous
circumvent
contravene
convection
conventional
provenance
vindicate
vindictive
avenge
vengeance
aver
veracious
verified
verisimilitude
veritable
verbose
vernacular
verdant
convergent
divergent
adversary
adversity
inadvertent
aversion
avert
incontrovertible
conversant
convert
divert
invert
overt
perverse
reversible
revert
subvert
versatile
vestige
inveterate
deviant
deviate
devious
impervious
obviate
viable
viaduct
reverberant
conviction
evince
vigilant
invigorate
vigorous
beguile
guile
gullible
revile
villify
vitiate
virulence
virtue
virtuosity
envision
improvise
invidious
providential
provisional
revise
vista
revitalize
vital
vitality
vivacious
advocate
equivocal
evocative
irrevocable
provocative
univocal
vociferous
devoid
malevolent
volatile
convoluted
devolve
revolt
voluble
welter
carnivorous
devour
herbivorous
voracious
ravenous
avow
disavow
divulge
promulgate
vulgar

abet
abeyance
abreast
abridge
absorbing
absurd
abysmal
acquisitive
ad hoc
adamant
adolescent
adulation
aghast
alacrity
albeit
allay
allure
aloof
amalgam
analogous
ancillary
anecdote
anoint
antidote
aplomb
arcane
archaic
arduous
artful
ascetic
asseverate
assuage
astute
at adds
atrocity
atrophy
augur
austere
avant-garde
avarice
awry
axiomatic
backbite
badger
baffle
banal
banter
baroque
barren
bashful
bearing
befuddle
begrudging
beleaguer
belie
berate
bereft
besiege
bespeak
bland
blatnt
blight
blunder
bogus
bolster
boorish
bourgeois
braggart
brandish
bravado
brazen
bristle
bromidic
brook
bucolic
bouyant
burgeoning
buttress
byline
bypass
cache
cagey
cajole
calamity
callow
calumnious
calumny
camourflage
canned
capricious
caricature
categorical
caterwaul
cerebral
chagrin
champion
chic
chicanery
chide
choleric
chimerea
churlish
clear-cut
cliquish
coddle
coerce
cogent
colossal
comity
commonplace
compromise
conceivable
connive
contempt
contest
contrive
cosseted
crabby
craven
crestfallen
cronyism
dabble
daunting
dearth
debacle
debilitate
debunk
debut
decimate
decry
defy
delimit
dense
derelict
descry
deterioration
detest
deterimental
dire
discontinuity
disgruntle
disinterested
disproportionate
distill
doldrums
downplay
drollness
dwindle
abb
abullient
edify
elegy
embody
empiricism
encomium
enfeeble
enfetter
entail
entice
eschewesoteric
espouse
estrange
exemplify
exiguous
exodus
extirpate
extol
extraneous
exuberant
exude
fastidious
fabricate
fathom
faux pas
fawn
fecund
feign
ferocity
fickle
fitfully
flagged
flagrant
flair
faunt
fleeting
flippant
flout
fluctuate
flummery
foil
forage
forbear
forebode
foreshadow
forgo
fomidable
forthright
foruitous
foster
franchise
fraught
frugla
furtive
futile
gaffe
fainsay
galvanize
garrulous
gauge
glamorous
glean
glut
gripe
hackneyed
halfhearted
hamper
harangue
haughty
haunt
hauteur
hectic
hedonistic
heed
heyday
histrionic
hiherto
hodgepodge
hone
honorific
hubris
hunch
imbue
impeachable
impenetrable
imperil
impromptu
inchoate
indifferent
indigent
indulgent
industrious
inhibit
inquisitive
intelligible
interplay
intrinsic
inure
invective
inveigle
irenic
jejune
jeopardize
jettison
jubilant
knotty
lament
languish
latent
lavish
lax
lay out
layperson
lethal
lethargic
limpid
lionize
list
loath
loathe
lopsided
lugubrious
lull
lurid
malinger
malleable
manifest
mar
mawkish
meager
meander
melancholy
mercurial
meretricious
meticulous
mire
modicum
momentary
momentous
morose
motley
mundane
nadir
naysayer
nebulous
nepotism
nuance
numinous
obeisance
oblique
oblivious
odious
officious
opprobrium
ordeal
oscillate
ostensible
ostentatious
oust
outgrowth
overarching
overbeaning
override
overwrought
palliative
panacea
paradigm
parochial
parasimonious
paucity
peculiar
peevish
penurious
permeate
perquisite
persistent
philistine
phlegmatic
physiological
pigeonhole
pilferage
plaintive
plastic
poignant
polemical
pragmatic
preequisite
presage
pretentious
prickly
prodigy
propensity
protean
provincial
puerile
qualify
quandary
quarrel
querulous
quixotic
rail at
rampant
rancor
rant
rapprochement
rarified
rationale
rebuff
rebuke
rebut
reconnaissance
redeem
rehash
reiterate
relish
reproach
restive
retaliate
reticent
retrograde
revel
revere
ridge
rumination
sabotage
sarcastic
sardonic
sartorial
saturnine
savor
scant
scathing
schematic
scintillate
scourge
scruple
scrupulous
secular
serendipitous
shackle
shading
shirk
shrewd
shun
sift
skittish
skulduggery
slake
slapdash
slumber
slur
snobbery
somatic
sordid
sound
spontaneous
sporadic
sporadic
spurious
spurn
squander
staggering
staple
sterling
stifle
stipulate
stoicism
stratification
stymie
substantial
substantiate
sumptuous
supplement
syntax
taciturn
tantalize
taxing
testament
testimony
tedious
temerity
tepid
terse
thrift
thwart
torpor
trifling
trite
trivial
truculent
truncated
tyranny
ubiquitous
uncanny
unctuous
undercut
undermine
ungainly
universality
unkempt
unscathed
unseemly
unwieldy
unwittingly
upheaval
vacant
vacillate
vanguard
vehement
venal
veneration
wane
wanting
wary
whimsical
wont
woo
zealous
zenith